{"vocab": ["research", "students", "institute", "jodhpur", "department", "iit", "engineering", "academic", "courses", "science", "technology", "tech", "computer", "systems", "faculty", "lab", "programs", "projects", "technical", "student", "phd", "companies", "energy", "provide", "including", "campus", "postgraduate", "program", "eight", "year", "national", "facilities", "laboratories", "areas", "learning", "data", "industry", "leading", "design", "desert", "solar", "several", "education", "undergraduate", "semester", "core", "sciences", "must", "include", "doctoral", "joining", "support", "government", "international", "offers", "machine", "processing", "vision", "members", "funded", "collaborations", "innovation", "includes", "internship", "smart", "india", "interdisciplinary", "new", "rajasthan", "technologies", "centre", "sustainable", "graduates", "indian", "minimum", "point", "senate", "body", "every", "registration", "office", "distributed", "across", "follows", "course", "form", "master", "expected", "thesis", "committee", "scholar", "one", "reputed", "years", "financial", "full", "time", "participate", "conferences", "state", "computing", "artificial", "intelligence", "actively", "sponsored", "agencies", "dst", "hosts", "foster", "culture", "alumni", "institutions", "curriculum", "management", "power", "signal", "communications", "digital", "development", "renewable", "biomedical", "advanced", "devices", "instruments", "funding", "mechanical", "thermal", "manufacturing", "computational", "relevant", "ecosystem", "water", "established", "excellence", "materials", "significantly", "hundred", "patents", "spans", "world", "various", "sports", "placement", "recruitment", "domains", "journals", "provides", "microsoft", "positions", "regulations", "govern", "conduct", "required", "maintain", "cumulative", "grade", "average", "continue", "enrollment", "supreme", "responsible", "maintaining", "standards", "instruction", "examination", "register", "stipulated", "period", "late", "permitted", "fine", "specified", "credit", "requirement", "bachelor", "semesters", "classified", "elective", "humanities", "social", "clear", "eligible", "graduation", "grading", "system", "ten", "scale", "letter", "grades", "fails", "repeat", "subsequent", "offered", "integrity", "utmost", "importance", "plagiarism", "treated", "serious", "misconduct", "doctor", "philosophy", "admission", "gate", "score", "followed", "level", "interview", "admissions", "held", "twice", "july", "january", "scholars", "complete", "coursework", "first", "subsequently", "focus", "advisory", "guides", "throughout", "publish", "least", "paper", "journal", "before", "submission", "maximum", "duration", "completing", "degree", "six", "date", "scholarship", "provided", "norms", "encouraged", "present", "findings", "broader", "scientific", "community", "art", "high", "performance", "clusters", "dedicated", "span", "natural", "language", "cybersecurity", "theoretical", "engaged", "drdo", "meity", "regular", "seminars", "workshops", "hackathons", "placed", "worldwide", "cse", "programming", "structures", "algorithms", "operating", "database", "networks", "software", "electrical", "focusing", "vlsi", "electronics", "analog", "circuits", "embedded", "collaborates", "partners", "opportunities", "grids", "semiconductor", "competitions", "hackathon", "texas", "challenge", "commendable", "results", "jointly", "physics", "mathematics", "departments", "broad", "foundation", "received", "serb", "ministry", "covers", "solid", "mechanics", "fluid", "dynamics", "robotics", "activities", "often", "address", "challenges", "harvesting", "dust", "mitigation", "strategies", "panels", "undertake", "week", "industrial", "training", "final", "gain", "practical", "experience", "annual", "festival", "showcase", "prototypes", "centres", "conducts", "deep", "applications", "healthcare", "agriculture", "cities", "focuses", "arid", "regions", "conservation", "construction", "biotechnology", "bioinformatics", "group", "works", "genomics", "protein", "structure", "prediction", "drug", "discovery", "methods", "active", "premier", "isro", "barc", "csir", "universities", "germany", "japan", "france", "united", "states", "grown", "total", "externally", "exceeding", "two", "crore", "rupees", "encourages", "file", "granted", "storage", "iits", "set", "expand", "higher", "country", "located", "historic", "city", "gateway", "thar", "permanent", "acres", "features", "modern", "residential", "infrastructure", "commitment", "societal", "impact", "mission", "class", "develop", "nurture", "leaders", "governing", "board", "finance", "oversee", "administrative", "matters", "respectively", "diverse", "foreign", "enrolled", "cultural", "festivals", "organized", "bodies", "vibrant", "life", "cell", "facilitates", "visiting", "multiple", "basic", "pursuing", "levels", "bringing", "fresh", "perspectives", "cutting", "edge", "methodologies", "contributing", "knowledge", "generation", "publication", "papers", "indicates", "healthy", "startup", "growing", "entrepreneurs", "founding", "incubation", "mentoring", "nascent", "startups", "industries", "lead", "consultancy", "providing", "real", "context", "compulsory", "work", "labs", "record", "consistently", "strong", "recruited", "google", "amazon", "adobe", "samsung", "qualcomm", "tcs", "infosys", "among", "many", "others", "median", "package", "seen", "upward", "trend", "past", "reflecting", "quality", "specializations", "security", "networking", "analytics", "highly", "sought", "academia", "alike", "iisc", "nit", "tata", "ibm", "other", "organizations", "showcases", "architecture", "buildings", "designed", "passive", "cooling", "reduce", "consumption", "equipped", "latest", "equipment", "central", "library", "houses", "extensive", "collection", "books", "resources", "hostels", "comfortable", "living", "environment", "cricket", "ground", "football", "field", "tennis", "courts", "swimming", "pool", "gymnasium", "indoor", "games", "room", "health", "medical", "staff", "canteen", "mess", "nutritious", "food", "options", "also", "has", "atm", "bank", "post", "convenience", "stores", "meeting", "daily", "needs"], "size": 534}